/*
const myCity = [
	{
		"name": "安徽",
		"state": [{
			"name": "蚌埠",
			"state": [{
				"name": "蚌埠星辉汽车销售服务有限公司"
			}]
		},
		{
			"name": "阜阳",
			"state": [{
				"name": "阜阳伟久汽车销售服务有限公司"
			}]
		},
		{
			"name": "合肥",
			"state": [{
				"name": "安徽之星汽车销售服务有限公司"
			},
			{
				"name": "合肥利之星汽车服务有限公司"
			},
			{
				"name": "安徽鹏龙融富汽车销售服务有限公司"
			}]
		},
		{
			"name": "马鞍山",
			"state": [{
				"name": "马鞍山之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "铜陵",
			"state": [{
				"name": "铜陵利星汽车销售服务有限公司"
			}]
		},
		{
			"name": "芜湖",
			"state": [{
				"name": "芜湖中星汽车销售服务有限公司北京中路分公司"
			},
			{
				"name": "芜湖中星汽车销售服务有限公司"
			}]
		},
		{
			"name": "亳州",
			"state": [{
				"name": "亳州之星汽车有限公司"
			}]
		},
		{
			"name": "淮南",
			"state": [{
				"name": "淮南之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "淮北",
			"state": [{
				"name": "淮北万帮之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "六安",
			"state": [{
				"name": "六安恒信之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "宣城",
			"state": [{
				"name": "宣城利星汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "江苏",
		"state": [{
			"name": "苏州",
			"state": [{
				"name": "常熟中升之星汽车销售服务有限公司"
			},
			{
				"name": "昆山利星汽车服务有限公司"
			},
			{
				"name": "苏州海星汽车销售服务有限公司"
			},
			{
				"name": "苏州海星高新汽车销售服务有限公司"
			},
			{
				"name": "苏州利星汽车服务有限公司"
			},
			{
				"name": "苏州利星汽车服务有限公司园区旺墩路分公司"
			},
			{
				"name": "苏州元星汽车服务有限公司"
			},
			{
				"name": "太仓中升之星汽车销售服务有限公司"
			},
			{
				"name": "吴江之星汽车销售服务有限公司"
			},
			{
				"name": "张家港海星汽车销售服务有限公司"
			},
			{
				"name": "苏州鹏龙东昌汽车销售服务有限公司"
			}]
		},
		{
			"name": "常州",
			"state": [{
				"name": "常州之星汽车有限公司"
			},
			{
				"name": "常州外汽星豪汽车销售服务有限公司"
			},
			{
				"name": "常州万帮汽车销售服务有限公司"
			},
			{
				"name": "常州外汽永豪汽车销售服务有限公司"
			},
			{
				"name": "常州外汽东豪汽车销售服务有限公司"
			}]
		},
		{
			"name": "淮安",
			"state": [{
				"name": "淮安之星汽车销售服务有限公司"
			},
			{
				"name": "淮安之星汽车销售服务有限公司清河新区分公司"
			},
			{
				"name": "淮安万帮金星汽车销售有限公司"
			}]
		},
		{
			"name": "无锡",
			"state": [{
				"name": "江阴利之星汽车维修服务有限公司"
			},
			{
				"name": "无锡可达汽车销售服务有限公司"
			},
			{
				"name": "无锡德星汽车维修服务有限公司"
			},
			{
				"name": "无锡德星汽车维修服务有限公司河埒口分公司"
			},
			{
				"name": "无锡中升之星汽车销售服务有限公司"
			},
			{
				"name": "无锡中升星辉汽车销售服务有限公司"
			},
			{
				"name": "宜兴利星汽车销售服务有限公司"
			},
			{
				"name": "宜兴市鹏龙汽车销售服务有限公司"
			}]
		},
		{
			"name": "泰州",
			"state": [{
				"name": "泰州之星汽车销售服务有限公司靖江分公司"
			},
			{
				"name": "泰州之星汽车销售服务有限公司"
			},
			{
				"name": "泰州市海驰汽车销售服务有限公司"
			}]
		},
		{
			"name": "连云港",
			"state": [{
				"name": "连云港之星汽车销售有限公司"
			},
			{
				"name": "连云港之星汽车销售有限公司信驰分公司"
			}]
		},
		{
			"name": "南京",
			"state": [{
				"name": "江苏中驰汽车销售服务有限公司"
			},
			{
				"name": "南京利之星汽车销售服务有限公司"
			},
			{
				"name": "南京利之星汽车销售服务有限公司红山路分公司"
			},
			{
				"name": "南京宁星汽车维修服务有限公司"
			},
			{
				"name": "南京中升之星汽车销售服务有限公司"
			},
			{
				"name": "南京中升之星汽车销售服务有限公司建邺分公司"
			},
			{
				"name": "江苏中驰汽车销售服务有限公司南京秦淮分公司"
			},
			{
				"name": "南京万帮新区汽车销售服务有限公司"
			},
			{
				"name": "南京宁星汽车维修服务有限公司雨花东路分公司"
			},
			{
				"name": "南京江北之星汽车服务有限公司"
			}]
		},
		{
			"name": "南通",
			"state": [{
				"name": "南通之星汽车维修服务有限公司"
			},
			{
				"name": "南通文峰伟恒汽车销售服务有限公司"
			},
			{
				"name": "南通和星汽车销售服务有限公司"
			},
			{
				"name": "启东之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "宿迁",
			"state": [{
				"name": "宿迁文峰伟恒汽车销售服务有限公司"
			}]
		},
		{
			"name": "徐州",
			"state": [{
				"name": "徐州利星行汽车服务有限公司"
			},
			{
				"name": "徐州之星汽车有限公司"
			}]
		},
		{
			"name": "盐城",
			"state": [{
				"name": "盐城之星汽车有限公司"
			},
			{
				"name": "盐城市鹏龙森风汽车有限公司"
			}]
		},
		{
			"name": "扬州",
			"state": [{
				"name": "扬州利之星汽车维修服务有限公司"
			},
			{
				"name": "扬州海星汽车销售服务有限公司"
			}]
		},
		{
			"name": "镇江",
			"state": [{
				"name": "镇江京之星汽车有限公司"
			},
			{
				"name": "丹阳之星汽车零部件有限公司"
			}]
		}]
	},
	{
		"name": "上海",
		"state": [{
			"name": "上海",
			"state": [{
				"name": "上海宝利德汽车有限公司"
			},
			{
				"name": "上海东驰汽车有限公司"
			},
			{
				"name": "上海东驰汽车有限公司世纪大道分公司"
			},
			{
				"name": "上海东驰汽车有限公司昭化路分公司"
			},
			{
				"name": "上海东华之星汽车维修服务有限公司宝山分公司"
			},
			{
				"name": "上海冠松之星汽车销售服务有限公司"
			},
			{
				"name": "上海汇之星汽车维修服务有限公司"
			},
			{
				"name": "上海利之星汽车有限公司"
			},
			{
				"name": "上海利之星汽车有限公司闵行分公司"
			},
			{
				"name": "上海闵星汽车服务有限公司"
			},
			{
				"name": "上海闵星汽车服务有限公司金桥分公司"
			},
			{
				"name": "上海利星汽车维修有限公司"
			},
			{
				"name": "上海利星汽车维修有限公司延安西路分公司"
			},
			{
				"name": "上海星瀚汽车维修服务有限公司"
			},
			{
				"name": "上海星瀚汽车维修服务有限公司金沙江路分公司"
			},
			{
				"name": "上海星瀚汽车维修服务有限公司真陈路分公司"
			},
			{
				"name": "上海中升之星汽车销售服务有限公司"
			},
			{
				"name": "上海中升奉星汽车销售服务有限公司"
			},
			{
				"name": "上海越星汽车有限公司"
			}]
		}]
	},
	{
		"name": "浙江",
		"state": [{
			"name": "宁波",
			"state": [{
				"name": "浙江慈吉之星汽车有限公司"
			},
			{
				"name": "浙江慈吉之星汽车有限公司周巷分公司"
			},
			{
				"name": "宁波利星汽车服务有限公司"
			},
			{
				"name": "宁波宁兴新宇汽车销售服务有限公司"
			},
			{
				"name": "宁波之星汽车维修服务有限公司"
			},
			{
				"name": "浙江慈吉之星汽车有限公司余姚分公司"
			},
			{
				"name": "宁波利之星汽车服务有限公司"
			},
			{
				"name": "宁波和星汽车销售服务有限公司"
			},
			{
				"name": "宁海慈吉之星汽车有限公司"
			}]
		},
		{
			"name": "金华",
			"state": [{
				"name": "浙江利星汽车有限公司"
			},
			{
				"name": "金华金之星汽车贸易有限公司"
			},
			{
				"name": "浦江丰之星汽车销售服务有限公司"
			},
			{
				"name": "义乌欧龙汽车销售服务有限公司"
			},
			{
				"name": "义乌欧龙汽车销售服务有限公司汽车城分公司"
			},
			{
				"name": "义乌利星汽车有限公司雪峰路分公司"
			},
			{
				"name": "义乌利星汽车有限公司"
			},
			{
				"name": "永康市国邦汽车销售有限公司"
			},
			{
				"name": "永康利之星汽车销售服务有限公司"
			},
			{
				"name": "义乌市新徽汽车销售服务有限公司"
			}]
		},
		{
			"name": "杭州",
			"state": [{
				"name": "杭州之信汽车有限公司"
			},
			{
				"name": "杭州百得利之星汽车销售有限公司"
			},
			{
				"name": "杭州东星行汽车维修有限公司"
			},
			{
				"name": "浙江星杭汽车有限公司"
			},
			{
				"name": "浙江星杭汽车有限公司教工路分公司"
			},
			{
				"name": "浙江华策北控汽车有限公司"
			},
			{
				"name": "浙江华策汽车有限公司"
			},
			{
				"name": "浙江之信汽车有限公司"
			},
			{
				"name": "杭州奕星汽车服务有限公司"
			},
			{
				"name": "浙江鹏龙之奔汽车销售服务有限公司"
			},
			{
				"name": "浙江鹏龙之奔汽车销售服务有限公司杭州富春路分公司"
			}]
		},
		{
			"name": "嘉兴",
			"state": [{
				"name": "海宁利星汽车有限公司"
			},
			{
				"name": "嘉兴宝利德汽车有限公司"
			},
			{
				"name": "嘉兴合信汽车销售服务有限公司"
			},
			{
				"name": "桐乡利之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "湖州",
			"state": [{
				"name": "长兴之星汽车有限公司"
			},
			{
				"name": "湖州之星汽车有限公司"
			},
			{
				"name": "湖州之星汽车有限公司德清分公司"
			}]
		},
		{
			"name": "台州",
			"state": [{
				"name": "临海欧龙汽车有限公司"
			},
			{
				"name": "台州欧普汽车销售有限公司"
			},
			{
				"name": "台州之星汽车销售服务有限公司"
			},
			{
				"name": "台州之星汽车销售服务有限公司路桥分公司"
			},
			{
				"name": "台州德星汽车有限公司"
			},
			{
				"name": "台州德星汽车有限公司温岭九龙分公司"
			},
			{
				"name": "台州黄岩之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "丽水",
			"state": [{
				"name": "丽水市丽水之星汽车有限公司"
			}]
		},
		{
			"name": "衢州",
			"state": [{
				"name": "衢州欧龙汽车有限公司"
			}]
		},
		{
			"name": "温州",
			"state": [{
				"name": "瑞安市红升汽车销售服务有限公司"
			},
			{
				"name": "温州之星汽车有限公司"
			},
			{
				"name": "浙江欧龙汽车有限公司"
			},
			{
				"name": "乐清华星汽车销售服务有限公司"
			},
			{
				"name": "浙江欧龙汽车有限公司温州销售分公司"
			},
			{
				"name": "温州华能达汽车销售服务有限公司"
			}]
		},
		{
			"name": "绍兴",
			"state": [{
				"name": "绍兴之星汽车有限公司"
			},
			{
				"name": "浙江越星汽车有限公司"
			},
			{
				"name": "嵊州宝利德汽车有限公司"
			},
			{
				"name": "浙江宝利德汽车有限公司"
			}]
		},
		{
			"name": "舟山",
			"state": [{
				"name": "舟山利星汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "北京",
		"state": [{
			"name": "北京",
			"state": [{
				"name": "北京亚奥之星汽车服务有限公司"
			},
			{
				"name": "北京市北奔汽车修理厂"
			},
			{
				"name": "北京百得利之星汽车销售有限公司"
			},
			{
				"name": "北京博瑞祥驰汽车销售服务有限公司"
			},
			{
				"name": "北京波士诚达汽车销售服务有限公司"
			},
			{
				"name": "北京波士瑞达汽车销售服务有限公司"
			},
			{
				"name": "北京波士通达汽车销售服务有限公司"
			},
			{
				"name": "北京金冠汽车服务有限公司"
			},
			{
				"name": "北京中升之星汽车销售服务有限公司"
			},
			{
				"name": "北京鹏龙大道汽车销售服务有限公司"
			},
			{
				"name": "北京鹏龙星徽汽车销售服务有限公司"
			},
			{
				"name": "北京鹏龙星徽汽车销售服务有限公司崇文展厅"
			},
			{
				"name": "北京鹏龙星徽汽车销售服务有限公司分钟寺销售服务中心"
			},
			{
				"name": "北京星徽旗舰汽车销售服务中心有限公司"
			},
			{
				"name": "利星行（北京）汽车有限公司"
			},
			{
				"name": "利星行平治（北京）汽车有限公司"
			},
			{
				"name": "利星行平治（北京）汽车有限公司望京分公司"
			},
			{
				"name": "利星行之星（北京）汽车有限公司"
			},
			{
				"name": "利星行天竺之星汽车有限公司"
			},
			{
				"name": "利星行天竺之星汽车有限公司顺义分公司"
			},
			{
				"name": "利星行（北京）汽车维修服务有限公司"
			},
			{
				"name": "北京之星汽车服务有限公司"
			}]
		}]
	},
	{
		"name": "河北",
		"state": [{
			"name": "保定",
			"state": [{
				"name": "保定金锎至臻汽车销售服务有限公司"
			},
			{
				"name": "保定极致汽车销售服务有限公司"
			}]
		},
		{
			"name": "沧州",
			"state": [{
				"name": "沧州极致汽车销售服务有限公司"
			},
			{
				"name": "利星行（沧州）汽车销售服务有限公司"
			}]
		},
		{
			"name": "邯郸",
			"state": [{
				"name": "邯郸市庞大乐业汽车销售服务有限公司"
			},
			{
				"name": "邯郸市庞大乐业汽车销售服务有限公司武安分公司"
			}]
		},
		{
			"name": "衡水",
			"state": [{
				"name": "衡水庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "秦皇岛",
			"state": [{
				"name": "利星行（秦皇岛）汽车销售有限公司"
			}]
		},
		{
			"name": "石家庄",
			"state": [{
				"name": "河北跨世之星汽车贸易有限公司"
			},
			{
				"name": "河北盛世之星汽车贸易有限公司"
			},
			{
				"name": "石家庄庞大睿星汽车销售服务有限公司"
			},
			{
				"name": "石家庄庞大睿星汽车销售服务有限公司建华分公司"
			},
			{
				"name": "河北汇世之星汽车贸易有限公司"
			}]
		},
		{
			"name": "唐山",
			"state": [{
				"name": "唐山市冀东之星汽车销售服务有限公司"
			},
			{
				"name": "唐山市庞大润星汽车销售服务有限公司"
			},
			{
				"name": "唐山市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "邢台",
			"state": [{
				"name": "邢台市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "承德",
			"state": [{
				"name": "承德市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "廊坊",
			"state": [{
				"name": "廊坊利星行汽车销售服务有限公司"
			},
			{
				"name": "三河波士智达汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "黑龙江",
		"state": [{
			"name": "大庆",
			"state": [{
				"name": "大庆之星汽车有限公司"
			}]
		},
		{
			"name": "哈尔滨",
			"state": [{
				"name": "哈尔滨之星汽车有限公司"
			},
			{
				"name": "黑龙江中升之星汽车销售服务有限公司哈尔滨分公司"
			},
			{
				"name": "黑龙江中升之星汽车销售服务有限公司"
			},
			{
				"name": "黑龙江运通之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "绥化",
			"state": [{
				"name": "绥化市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "佳木斯",
			"state": [{
				"name": "佳木斯利星汽车有限公司"
			}]
		}]
	},
	{
		"name": "河南",
		"state": [{
			"name": "安阳",
			"state": [{
				"name": "安阳极致汽车销售服务有限公司"
			}]
		},
		{
			"name": "焦作",
			"state": [{
				"name": "焦作鹏龙得佳汽车销售有限公司"
			}]
		},
		{
			"name": "漯河",
			"state": [{
				"name": "郑州鹏龙万通汽车销售有限公司漯河分公司"
			}]
		},
		{
			"name": "洛阳",
			"state": [{
				"name": "洛阳市庞大乐业汽车销售服务有限公司"
			}]
		},
		{
			"name": "平顶山",
			"state": [{
				"name": "平顶山利星汽车销售有限公司"
			}]
		},
		{
			"name": "商丘",
			"state": [{
				"name": "商丘市鹏东汽车销售服务有限公司"
			}]
		},
		{
			"name": "新乡",
			"state": [{
				"name": "新乡市利星汽车销售有限公司"
			}]
		},
		{
			"name": "信阳",
			"state": [{
				"name": "信阳利星汽车销售有限公司"
			}]
		},
		{
			"name": "许昌",
			"state": [{
				"name": "许昌利星汽车销售有限公司"
			}]
		},
		{
			"name": "郑州",
			"state": [{
				"name": "郑州利星汽车有限公司"
			},
			{
				"name": "郑州鹏龙万通汽车销售有限公司"
			},
			{
				"name": "郑州之星汽车销售服务有限公司"
			},
			{
				"name": "郑州之星汽车销售服务有限公司金水路分公司"
			},
			{
				"name": "郑州汇升汽车销售服务有限公司"
			}]
		},
		{
			"name": "驻马店",
			"state": [{
				"name": "驻马店鹏龙得佳汽车销售服务有限公司"
			}]
		},
		{
			"name": "济源",
			"state": [{
				"name": "济源市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "南阳",
			"state": [{
				"name": "南阳市庞大之星汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "内蒙古",
		"state": [{
			"name": "包头",
			"state": [{
				"name": "内蒙古奥捷之星汽车销售服务有限公司"
			},
			{
				"name": "包头中升之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "赤峰",
			"state": [{
				"name": "赤峰市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "呼和浩特",
			"state": [{
				"name": "内蒙古之星汽车有限公司"
			},
			{
				"name": "呼和浩特中升之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "鄂尔多斯",
			"state": [{
				"name": "鄂尔多斯之星汽车有限公司"
			}]
		},
		{
			"name": "通辽",
			"state": [{
				"name": "通辽市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "乌海",
			"state": [{
				"name": "乌海市庞大之星汽车销售有限公司"
			}]
		},
		{
			"name": "呼伦贝尔",
			"state": [{
				"name": "呼伦贝尔利星汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "吉林",
		"state": [{
			"name": "长春",
			"state": [{
				"name": "长春华星行汽车销售服务有限公司"
			},
			{
				"name": "长春之星汽车有限公司"
			},
			{
				"name": "吉林省成邦之星汽车销售服务有限公司"
			},
			{
				"name": "利星行（长春）汽车有限公司"
			}]
		},
		{
			"name": "吉林",
			"state": [{
				"name": "长春之星汽车有限公司吉林市分公司"
			}]
		},
		{
			"name": "延边朝鲜族自治州",
			"state": [{
				"name": "延吉市庞大之星汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "辽宁",
		"state": [{
			"name": "鞍山",
			"state": [{
				"name": "鞍山四隆之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "朝阳",
			"state": [{
				"name": "朝阳四隆之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "大连",
			"state": [{
				"name": "大连中星汽车有限公司"
			},
			{
				"name": "大连中升之星汽车销售服务有限公司"
			},
			{
				"name": "利星（大连）汽车服务有限公司"
			},
			{
				"name": "大连鹏龙腾川汽车销售服务有限公司"
			},
			{
				"name": "大连中升星辉汽车销售服务有限公司"
			}]
		},
		{
			"name": "锦州",
			"state": [{
				"name": "锦州之星汽车有限公司"
			}]
		},
		{
			"name": "沈阳",
			"state": [{
				"name": "辽宁业乔宏星汽车销售服务有限公司"
			},
			{
				"name": "辽宁之星汽车维修服务有限公司"
			},
			{
				"name": "辽宁之星汽车销售有限公司北市展示厅"
			},
			{
				"name": "沈阳业乔瑞星汽车销售服务有限公司"
			}]
		},
		{
			"name": "营口",
			"state": [{
				"name": "营口之星汽车有限公司"
			}]
		},
		{
			"name": "辽阳",
			"state": [{
				"name": "辽阳业乔瑞星汽车销售服务有限公司"
			}]
		},
		{
			"name": "盘锦",
			"state": [{
				"name": "盘锦之星汽车有限公司"
			}]
		}]
	},
	{
		"name": "山东",
		"state": [{
			"name": "德州",
			"state": [{
				"name": "德州市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "东营",
			"state": [{
				"name": "东营泰岳星徽汽车有限公司"
			},
			{
				"name": "东营五岳星徽汽车有限公司"
			}]
		},
		{
			"name": "济南",
			"state": [{
				"name": "济南庞大之星汽车销售服务有限公司"
			},
			{
				"name": "济南之星汽车服务有限公司"
			},
			{
				"name": "济南万帮之星汽车有限公司"
			}]
		},
		{
			"name": "济宁",
			"state": [{
				"name": "济宁吉星汽车销售服务有限公司"
			}]
		},
		{
			"name": "聊城",
			"state": [{
				"name": "聊城欧龙汽车有限公司"
			}]
		},
		{
			"name": "临沂",
			"state": [{
				"name": "临沂远通之星汽车销售服务有限公司"
			},
			{
				"name": "临沂之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "青岛",
			"state": [{
				"name": "青岛三合汽车销售有限公司"
			},
			{
				"name": "青岛之星汽车服务有限公司"
			},
			{
				"name": "青岛之星汽车服务有限公司香港中路展厅"
			},
			{
				"name": "青岛之星汽车服务有限公司黄岛展厅"
			}]
		},
		{
			"name": "泰安",
			"state": [{
				"name": "泰安市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "潍坊",
			"state": [{
				"name": "潍坊鹏龙金阳光汽车销售服务有限公司"
			},
			{
				"name": "潍坊之星汽车服务有限公司"
			}]
		},
		{
			"name": "烟台",
			"state": [{
				"name": "烟台之星汽车服务有限公司"
			},
			{
				"name": "烟台鹏龙伟东汽车销售服务有限公司"
			}]
		},
		{
			"name": "淄博",
			"state": [{
				"name": "淄博星吉汽车销售服务有限公司"
			},
			{
				"name": "淄博吉星汽车销售服务有限公司"
			},
			{
				"name": "利星行（淄博）汽车销售服务有限公司"
			}]
		},
		{
			"name": "威海",
			"state": [{
				"name": "威海之星汽车服务有限公司"
			}]
		},
		{
			"name": "枣庄",
			"state": [{
				"name": "枣庄之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "日照",
			"state": [{
				"name": "日照金阳光之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "菏泽",
			"state": [{
				"name": "菏泽之星汽车服务有限公司"
			}]
		}]
	},
	{
		"name": "山西",
		"state": [{
			"name": "长治",
			"state": [{
				"name": "长治市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "大同",
			"state": [{
				"name": "山西必高之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "临汾",
			"state": [{
				"name": "临汾之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "朔州",
			"state": [{
				"name": "山西必高之星汽车销售服务有限公司朔州开发区分公司"
			},
			{
				"name": "山西必高之星汽车销售服务有限公司朔州分公司"
			}]
		},
		{
			"name": "太原",
			"state": [{
				"name": "太原利星汽车有限公司"
			},
			{
				"name": "太原之星汽车销售服务有限公司"
			},
			{
				"name": "太原之星汽车销售服务有限公司亲贤分公司"
			},
			{
				"name": "山西天健之星汽车销售服务有限公司"
			},
			{
				"name": "山西龙星行汽车销售服务有限公司"
			}]
		},
		{
			"name": "阳泉",
			"state": [{
				"name": "阳泉市庞大乐业汽车销售服务有限公司"
			}]
		},
		{
			"name": "晋城",
			"state": [{
				"name": "晋城天健之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "运城",
			"state": [{
				"name": "山西神驰汽车销售有限公司"
			}]
		}]
	},
	{
		"name": "天津",
		"state": [{
			"name": "天津",
			"state": [{
				"name": "天津市北信中乒之星汽车销售服务有限公司"
			},
			{
				"name": "天津波士信达汽车销售服务有限公司"
			},
			{
				"name": "天津市庞大之星汽车销售服务有限公司"
			},
			{
				"name": "天津之星汽车维修服务有限公司"
			},
			{
				"name": "天津之星汽车维修服务有限公司第一分公司"
			},
			{
				"name": "利星行（天津）汽车销售服务有限公司"
			},
			{
				"name": "天津波士宏达汽车销售服务有限公司"
			},
			{
				"name": "天津市鹏龙九州汽车销售服务有限公司"
			},
			{
				"name": "天津市鹏龙九州汽车销售服务有限公司南开分公司"
			}]
		}]
	},
	{
		"name": "广东",
		"state": [{
			"name": "东莞",
			"state": [{
				"name": "东莞仁孚华星汽车服务有限公司"
			},
			{
				"name": "东莞仁孚华星汽车服务有限公司常平分公司"
			},
			{
				"name": "东莞中升之星汽车销售服务有限公司"
			},
			{
				"name": "东莞仁孚溢华汽车服务有限公司"
			},
			{
				"name": "东莞仁孚溢华汽车服务有限公司长安分公司"
			}]
		},
		{
			"name": "佛山",
			"state": [{
				"name": "佛山怡和仁孚汽车服务有限公司"
			},
			{
				"name": "佛山市鹏龙利泰汽车销售服务有限公司"
			},
			{
				"name": "佛山市顺德区怡孚汽车销售服务有限公司"
			},
			{
				"name": "佛山中升之星汽车销售服务有限公司"
			},
			{
				"name": "佛山中升星辉汽车销售服务有限公司"
			}]
		},
		{
			"name": "潮州",
			"state": [{
				"name": "潮州骏荣汽车销售服务有限公司"
			}]
		},
		{
			"name": "广州",
			"state": [{
				"name": "广东仁孚怡邦汽车销售服务有限公司"
			},
			{
				"name": "广东仁孚怡邦汽车销售服务有限公司岑村分公司"
			},
			{
				"name": "广东仁孚怡邦汽车销售服务有限公司广州分公司"
			},
			{
				"name": "广州市龙星行汽车销售服务有限公司"
			},
			{
				"name": "广州市龙星行汽车销售服务有限公司番禺分公司"
			},
			{
				"name": "广州市龙星骏宜汽车销售服务有限公司"
			},
			{
				"name": "广州鸿粤星辉汽车销售服务有限公司"
			},
			{
				"name": "广州锦星行汽车零配件贸易有限公司"
			},
			{
				"name": "广州中升之星汽车销售服务有限公司"
			},
			{
				"name": "广州仁孚汽车销售服务有限公司"
			},
			{
				"name": "广州鸿粤星辉汽车销售服务有限公司白云分公司"
			}]
		},
		{
			"name": "惠州",
			"state": [{
				"name": "惠州市驰峰投资有限公司"
			},
			{
				"name": "惠州仁孚汽车服务有限公司"
			},
			{
				"name": "惠州仁孚汽车服务有限公司河南岸分公司"
			}]
		},
		{
			"name": "江门",
			"state": [{
				"name": "江门市合礼汽车销售服务有限公司"
			},
			{
				"name": "江门仁孚汽车销售服务有限公司"
			}]
		},
		{
			"name": "揭阳",
			"state": [{
				"name": "揭阳骏荣汽车销售服务有限公司"
			},
			{
				"name": "揭阳骏荣汽车销售服务有限公司普宁分公司"
			}]
		},
		{
			"name": "茂名",
			"state": [{
				"name": "茂名惠通之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "梅州",
			"state": [{
				"name": "汕头市骏荣汽车销售服务有限公司梅州分公司"
			}]
		},
		{
			"name": "清远",
			"state": [{
				"name": "清远市南菱星晖汽车有限公司"
			}]
		},
		{
			"name": "汕头",
			"state": [{
				"name": "汕头金豪汽车服务有限公司"
			},
			{
				"name": "汕头市骏荣汽车销售服务有限公司"
			}]
		},
		{
			"name": "韶关",
			"state": [{
				"name": "韶关市龙星行汽车销售服务有限公司"
			}]
		},
		{
			"name": "深圳",
			"state": [{
				"name": "深圳市鹏峰汽车销售服务有限公司"
			},
			{
				"name": "深圳市大兴宝德汽车销售服务有限公司"
			},
			{
				"name": "深圳市大兴宝德汽车销售服务有限公司罗湖分公司"
			},
			{
				"name": "深圳市福日汽车销售有限公司"
			},
			{
				"name": "深圳市南方腾星汽车销售服务有限公司"
			},
			{
				"name": "深圳市南方腾星汽车销售服务有限公司福田分公司"
			},
			{
				"name": "鹏星行汽车服务（深圳）有限公司"
			},
			{
				"name": "鹏星行汽车服务（深圳）有限公司罗湖分公司"
			},
			{
				"name": "鹏星行汽车服务（深圳）有限公司南山分公司"
			},
			{
				"name": "深圳中升星辉汽车销售服务有限公司福田分公司"
			},
			{
				"name": "深圳中升星辉汽车销售服务有限公司"
			},
			{
				"name": "深圳市仁孚特力汽车服务有限公司"
			},
			{
				"name": "深圳市仁孚特力汽车服务有限公司龙岗分公司"
			},
			{
				"name": "深圳市仁孚特力汽车服务有限公司罗湖分公司"
			}]
		},
		{
			"name": "湛江",
			"state": [{
				"name": "湛江市南菱星晖汽车有限公司"
			}]
		},
		{
			"name": "肇庆",
			"state": [{
				"name": "肇庆鸿粤嘉泰汽车销售服务有限公司"
			}]
		},
		{
			"name": "中山",
			"state": [{
				"name": "中山惠通之星汽车销售有限公司"
			},
			{
				"name": "中山仁孚汽车销售服务有限公司"
			}]
		},
		{
			"name": "珠海",
			"state": [{
				"name": "珠海仁孚汽车销售服务有限公司"
			},
			{
				"name": "珠海仁孚汽车销售服务有限公司拱北分公司"
			}]
		},
		{
			"name": "汕尾",
			"state": [{
				"name": "汕尾骏荣汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "福建",
		"state": [{
			"name": "福州",
			"state": [{
				"name": "福建波士运达汽车销售服务有限公司"
			},
			{
				"name": "福建波士骏达汽车销售服务有限公司"
			},
			{
				"name": "福州东星汽车维修服务有限公司"
			},
			{
				"name": "福州利之星汽车销售服务有限公司"
			},
			{
				"name": "福州之星汽车贸易有限公司梅峰路分公司"
			},
			{
				"name": "福州鹏龙国戎汽车销售服务有限公司"
			}]
		},
		{
			"name": "泉州",
			"state": [{
				"name": "福建省泉州闽星汽车销售服务有限公司"
			},
			{
				"name": "福建省泉州市瑞星汽车销售服务有限公司"
			},
			{
				"name": "泉州之星汽车销售服务有限公司"
			},
			{
				"name": "泉州之星汽车销售服务有限公司丰泽分公司"
			},
			{
				"name": "泉州中升之星汽车销售服务有限公司"
			},
			{
				"name": "石狮大长江红星汽车销售服务有限公司"
			},
			{
				"name": "泉州中升星辉汽车销售服务有限公司"
			}]
		},
		{
			"name": "龙岩",
			"state": [{
				"name": "龙岩之星汽车销售服务有限公司"
			},
			{
				"name": "龙岩之星汽车销售服务有限公司东肖分公司"
			}]
		},
		{
			"name": "宁德",
			"state": [{
				"name": "福州利之星汽车销售服务有限公司宁德分公司"
			},
			{
				"name": "宁德宝利德汽车有限公司"
			}]
		},
		{
			"name": "莆田",
			"state": [{
				"name": "莆田之星汽车有限公司荔城分公司"
			},
			{
				"name": "莆田之星汽车有限公司"
			}]
		},
		{
			"name": "三明",
			"state": [{
				"name": "福建吉诺中星汽车销售服务有限公司"
			}]
		},
		{
			"name": "厦门",
			"state": [{
				"name": "厦门市东之星汽车销售有限公司第一分公司"
			},
			{
				"name": "厦门空港航星汽车维修服务有限公司"
			},
			{
				"name": "厦门市东之星汽车销售有限公司"
			},
			{
				"name": "福建波士骏达汽车销售服务有限公司厦门分公司"
			}]
		},
		{
			"name": "漳州",
			"state": [{
				"name": "漳州极致汽车销售服务有限公司"
			}]
		},
		{
			"name": "南平",
			"state": [{
				"name": "南平极致汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "广西",
		"state": [{
			"name": "桂林",
			"state": [{
				"name": "桂林龙星行汽车销售服务有限公司"
			}]
		},
		{
			"name": "柳州",
			"state": [{
				"name": "柳州市华星行汽车销售服务有限公司"
			}]
		},
		{
			"name": "南宁",
			"state": [{
				"name": "广西龙星行汽车销售服务有限公司"
			},
			{
				"name": "广西龙星行汽车销售服务有限公司南宁分公司"
			},
			{
				"name": "南宁冠星汽车服务有限公司"
			},
			{
				"name": "南宁冠星汽车服务有限公司高新分公司"
			},
			{
				"name": "南宁恒信之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "北海",
			"state": [{
				"name": "北海弘之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "玉林",
			"state": [{
				"name": "玉林市龙星行汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "海南",
		"state": [{
			"name": "海口",
			"state": [{
				"name": "海南联合皇冠汽车服务有限公司"
			},
			{
				"name": "海南嘉华之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "三亚",
			"state": [{
				"name": "海南华诚之星汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "湖南",
		"state": [{
			"name": "长沙",
			"state": [{
				"name": "湖南龙星行汽车销售服务有限公司"
			},
			{
				"name": "湖南华美汽车销售服务有限公司"
			},
			{
				"name": "湖南华美汽车销售服务有限公司星腾分公司"
			},
			{
				"name": "湖南仁孚汽车销售服务有限公司"
			},
			{
				"name": "湖南鹏龙瑞丰汽车销售服务有限公司"
			}]
		},
		{
			"name": "郴州",
			"state": [{
				"name": "郴州鹏龙驰峰汽车销售服务有限公司"
			}]
		},
		{
			"name": "衡阳",
			"state": [{
				"name": "衡阳市驰峰汽车贸易有限公司"
			}]
		},
		{
			"name": "湘潭",
			"state": [{
				"name": "湘潭鸿粤凯泰汽车销售服务有限公司"
			}]
		},
		{
			"name": "株洲",
			"state": [{
				"name": "株洲溢华汽车销售服务有限公司"
			}]
		},
		{
			"name": "邵阳",
			"state": [{
				"name": "邵阳市大昌行汽车销售服务有限公司"
			}]
		},
		{
			"name": "娄底",
			"state": [{
				"name": "娄底宝利德汽车有限公司"
			}]
		},
		{
			"name": "常德",
			"state": [{
				"name": "常德仁孚汽车服务有限公司"
			}]
		},
		{
			"name": "怀化",
			"state": [{
				"name": "怀化恒信之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "岳阳",
			"state": [{
				"name": "岳阳蓝马汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "江西",
		"state": [{
			"name": "赣州",
			"state": [{
				"name": "赣州华宏星汽车有限公司"
			},
			{
				"name": "赣州华宏星汽车有限公司章贡区分公司"
			}]
		},
		{
			"name": "景德镇",
			"state": [{
				"name": "景德镇宝利德汽车有限公司"
			}]
		},
		{
			"name": "九江",
			"state": [{
				"name": "九江英之杰九星汽车销售服务有限公司"
			}]
		},
		{
			"name": "南昌",
			"state": [{
				"name": "江西华宏名驰汽车有限公司"
			},
			{
				"name": "南昌东之星汽车维修服务有限公司"
			},
			{
				"name": "江西华宏星汽车有限公司"
			},
			{
				"name": "南昌中升之星汽车销售服务有限公司"
			},
			{
				"name": "南昌迎星汽车销售服务有限公司"
			}]
		},
		{
			"name": "上饶",
			"state": [{
				"name": "江西省星徽行汽车销售有限公司"
			}]
		},
		{
			"name": "新余",
			"state": [{
				"name": "新余之星汽车服务有限公司"
			}]
		},
		{
			"name": "宜春",
			"state": [{
				"name": "宜春市星宜汽车销售服务有限公司"
			}]
		},
		{
			"name": "抚州",
			"state": [{
				"name": "景德镇宝利德汽车有限公司抚州分公司"
			}]
		},
		{
			"name": "吉安",
			"state": [{
				"name": "赣州华宏星汽车有限公司吉安分公司"
			}]
		},
		{
			"name": "鹰潭",
			"state": [{
				"name": "贵溪鹰之星汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "重庆",
		"state": [{
			"name": "重庆",
			"state": [{
				"name": "重庆市合翘汽车销售服务有限公司"
			},
			{
				"name": "重庆星顺汽车有限公司"
			},
			{
				"name": "重庆星顺汽车有限公司涪陵分公司"
			},
			{
				"name": "重庆星顺汽车有限公司联芳分公司"
			},
			{
				"name": "重庆星顺汽车有限公司万州分公司"
			},
			{
				"name": "重庆商社麒兴汽车销售服务有限公司"
			},
			{
				"name": "仁孚美源（重庆）汽车服务有限公司"
			},
			{
				"name": "仁孚美源（重庆）汽车服务有限公司南岸分公司"
			},
			{
				"name": "重庆仁星汽车服务有限公司"
			}]
		}]
	},
	{
		"name": "甘肃",
		"state": [{
			"name": "兰州",
			"state": [{
				"name": "甘肃鹏龙金城汽车销售服务有限责任公司"
			},
			{
				"name": "兰州之星汽车有限公司"
			}]
		}]
	},
	{
		"name": "贵州",
		"state": [{
			"name": "贵阳",
			"state": [{
				"name": "贵州鹏龙晨羲汽车销售服务有限公司"
			},
			{
				"name": "贵州贵星汽车销售服务有限公司"
			},
			{
				"name": "贵州贵星汽车销售服务有限公司贵阳分公司"
			}]
		},
		{
			"name": "遵义",
			"state": [{
				"name": "遵义仁孚汽车服务有限公司"
			}]
		}]
	},
	{
		"name": "湖北",
		"state": [{
			"name": "十堰",
			"state": [{
				"name": "十堰鹏贤汽车销售服务有限公司"
			}]
		},
		{
			"name": "武汉",
			"state": [{
				"name": "武汉中升聚星汽车销售服务有限公司硚口分公司"
			},
			{
				"name": "武汉宝利德汽车有限公司青山分公司"
			},
			{
				"name": "武汉星隆汽车销售服务有限公司"
			},
			{
				"name": "武汉星威汽车销售服务有限公司"
			},
			{
				"name": "武汉宝利德汽车有限公司"
			},
			{
				"name": "武汉中升聚星汽车销售服务有限公司"
			},
			{
				"name": "武汉鹏龙华通汽车贸易有限公司"
			}]
		},
		{
			"name": "襄阳",
			"state": [{
				"name": "襄阳恒信之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "宜昌",
			"state": [{
				"name": "宜昌恒信之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "黄石",
			"state": [{
				"name": "黄石市新源汽车销售有限公司"
			}]
		},
		{
			"name": "黄冈",
			"state": [{
				"name": "黄冈恒信之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "荆州",
			"state": [{
				"name": "荆州恒信之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "恩施",
			"state": [{
				"name": "恩施恒信之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "荆门",
			"state": [{
				"name": "荆门恒信之星汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "宁夏",
		"state": [{
			"name": "银川",
			"state": [{
				"name": "宁夏驰川汽车销售服务有限公司"
			},
			{
				"name": "宁夏利之星汽车有限公司"
			}]
		}]
	},
	{
		"name": "青海",
		"state": [{
			"name": "西宁",
			"state": [{
				"name": "青海嘉德汽车销售服务有限公司"
			},
			{
				"name": "青海之星汽车有限公司"
			}]
		}]
	},
	{
		"name": "陕西",
		"state": [{
			"name": "宝鸡",
			"state": [{
				"name": "西安之星汽车有限公司宝鸡分公司"
			}]
		},
		{
			"name": "西安",
			"state": [{
				"name": "西安华中星辉汽车销售服务有限公司"
			},
			{
				"name": "西安利之星汽车有限公司"
			},
			{
				"name": "西安利之星汽车有限公司高新分公司"
			},
			{
				"name": "西安之星汽车有限公司"
			},
			{
				"name": "西安新丰泰之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "榆林",
			"state": [{
				"name": "榆林市庞大乐业汽车销售服务有限公司"
			}]
		},
		{
			"name": "咸阳",
			"state": [{
				"name": "咸阳市庞大之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "渭南",
			"state": [{
				"name": "西安利之星汽车有限公司渭南分公司"
			}]
		},
		{
			"name": "汉中",
			"state": [{
				"name": "陕西汉中鹏龙中联之星汽车贸易有限公司"
			}]
		},
		{
			"name": "延安",
			"state": [{
				"name": "延安广汇之星汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "四川",
		"state": [{
			"name": "成都",
			"state": [{
				"name": "成都武侯华星锦业汽车销售服务有限公司"
			},
			{
				"name": "成都怡星仁孚汽车服务有限公司"
			},
			{
				"name": "成都中升之星汽车销售服务有限公司"
			},
			{
				"name": "成都仁孚南星汽车服务有限公司"
			},
			{
				"name": "成都仁孚汽车销售服务有限公司"
			},
			{
				"name": "四川华星锦业汽车销售服务有限公司"
			},
			{
				"name": "四川瑞星行汽车销售服务有限公司"
			},
			{
				"name": "成都中升智星汽车服务有限公司"
			}]
		},
		{
			"name": "德阳",
			"state": [{
				"name": "德阳华星锦业汽车销售服务有限公司"
			}]
		},
		{
			"name": "乐山",
			"state": [{
				"name": "乐山华星锦业汽车销售服务有限公司"
			},
			{
				"name": "乐山华星锦业汽车销售服务有限公司峨眉山分公司"
			}]
		},
		{
			"name": "眉山",
			"state": [{
				"name": "眉山华星锦业汽车销售服务有限公司"
			},
			{
				"name": "眉山华星锦业汽车销售服务有限公司仁寿分公司"
			}]
		},
		{
			"name": "绵阳",
			"state": [{
				"name": "绵阳华星锦业汽车销售服务有限公司"
			}]
		},
		{
			"name": "南充",
			"state": [{
				"name": "南充华星锦业汽车销售服务有限公司"
			}]
		},
		{
			"name": "攀枝花",
			"state": [{
				"name": "攀枝花远邦之星汽车销售服务有限公司"
			}]
		},
		{
			"name": "宜宾",
			"state": [{
				"name": "宜宾仁孚汽车服务有限公司"
			}]
		},
		{
			"name": "自贡",
			"state": [{
				"name": "自贡仁孚汽车服务有限公司"
			}]
		},
		{
			"name": "达州",
			"state": [{
				"name": "达州仁孚汽车服务有限公司"
			}]
		},
		{
			"name": "遂宁",
			"state": [{
				"name": "遂宁华星锦业汽车销售服务有限公司"
			}]
		},
		{
			"name": "广安",
			"state": [{
				"name": "广安华星锦业汽车销售服务有限公司"
			}]
		},
		{
			"name": "广元",
			"state": [{
				"name": "绵阳华星锦业汽车销售服务有限公司广元分公司"
			}]
		}]
	},
	{
		"name": "西藏",
		"state": [{
			"name": "拉萨",
			"state": [{
				"name": "西藏之星汽车销售有限公司"
			}]
		}]
	},
	{
		"name": "新疆",
		"state": [{
			"name": "乌鲁木齐",
			"state": [{
				"name": "新疆利星行汽车有限公司"
			},
			{
				"name": "新疆之星汽车有限公司"
			},
			{
				"name": "新疆天汇华驰汽车销售服务有限公司"
			}]
		},
		{
			"name": "阿克苏",
			"state": [{
				"name": "新疆阿克苏华驰汽车销售服务有限公司"
			}]
		},
		{
			"name": "喀什",
			"state": [{
				"name": "新疆喀什华驰汽车销售服务有限公司"
			}]
		},
		{
			"name": "哈密",
			"state": [{
				"name": "哈密汇驰汽车销售服务有限公司"
			}]
		},
		{
			"name": "伊犁",
			"state": [{
				"name": "新疆天汇汇驰汽车销售服务有限公司"
			}]
		}]
	},
	{
		"name": "云南",
		"state": [{
			"name": "大理",
			"state": [{
				"name": "大理俊星汽车有限公司"
			}]
		},
		{
			"name": "昆明",
			"state": [{
				"name": "昆明星旗汽车有限公司"
			},
			{
				"name": "云南俊星汽车销售有限公司"
			},
			{
				"name": "云南远安昆星汽车维修有限公司"
			}]
		},
		{
			"name": "曲靖",
			"state": [{
				"name": "曲靖嘉麒汽车销售有限公司"
			}]
		},
		{
			"name": "玉溪",
			"state": [{
				"name": "云南中凯虹星汽车销售服务有限公司"
			}]
		}]
	}
];
*/
/* For test the data of 2 level
const myCity = [
	{
		"name": "安徽",
		"state": [
		{
			"name": "蚌埠"
		},
		{
			"name": "合肥"
		}]
	},
	{
		"name": "江苏",
		"state": [
		{
			"name": "苏州"
		},
		{
			"name": "淮安"
		},
		{
			"name": "南京"
		}],
	},
	{
		"name": "上海",
		"state": [
		{
			"name": "上海"
		}]
	}
]
*/ 

// 3 level:
/*
const rawData=[
  {"province":"安徽","city":"蚌埠","shop":"蚌埠星辉汽车销售服务有限公司"},
  {"province":"安徽","city":"阜阳","shop":"阜阳伟久汽车销售服务有限公司"},
  {"province":"安徽","city":"合肥","shop":"安徽之星汽车销售服务有限公司"},
  {"province":"安徽","city":"合肥","shop":"合肥利之星汽车服务有限公司"},
  {"province":"安徽","city":"马鞍山","shop":"马鞍山之星汽车销售服务有限公司"},
  {"province":"安徽","city":"铜陵","shop":"铜陵利星汽车销售服务有限公司"},
  {"province":"安徽","city":"芜湖","shop":"芜湖中星汽车销售服务有限公司北京中路分公司"},
  {"province":"江苏","city":"苏州","shop":"常熟中升之星汽车销售服务有限公司"},
  {"province":"江苏","city":"常州","shop":"常州之星汽车有限公司"},
  {"province":"江苏","city":"常州","shop":"常州外汽星豪汽车销售服务有限公司"},
  {"province":"江苏","city":"常州","shop":"常州万帮汽车销售服务有限公司"},
  {"province":"江苏","city":"淮安","shop":"淮安之星汽车销售服务有限公司"},
  {"province":"江苏","city":"淮安","shop":"淮安之星汽车销售服务有限公司清河新区分公司"}
];
*/
//4 level:
const rawData = [
  {"province":"安徽","city":"宿州市","shop":"安徽汇玺通","phone":"0557-5815555"},
  {"province":"安徽","city":"合肥市","shop":"安徽上联","phone":"0551-64289788"},
  {"province":"安徽","city":"合肥市","shop":"安徽申众和","phone":"0551-63412888"},
  {"province":"安徽","city":"合肥市","shop":"安徽物华","phone":"0551-63877677"},
  {"province":"安徽","city":"合肥市","shop":"安徽智富","phone":"0551-65596111"},
  {"province":"安徽","city":"合肥市","shop":"安徽智富","phone":"0551-65579333"},
  {"province":"安徽","city":"安庆市","shop":"安庆福众","phone":"0556-5328605"},
  {"province":"安徽","city":"安庆市","shop":"安庆永兴","phone":"0556-5907788"},
  {"province":"安徽","city":"蚌埠市","shop":"蚌埠虹智","phone":"0552-2856555"},
  {"province":"安徽","city":"蚌埠市","shop":"蚌埠联众","phone":"0552-3713888"},
  {"province":"安徽","city":"亳州市","shop":"亳州春雨","phone":"0558-5015555"},
  {"province":"安徽","city":"亳州市","shop":"亳州亚夏众爱","phone":"0558-5673555"},
  {"province":"安徽","city":"巢湖","shop":"巢湖运众","phone":"0551-82665588"},
  {"province":"安徽","city":"池州市","shop":"池州浩智","phone":"0566--2611358"},
  {"province":"安徽","city":"滁州市","shop":"滁州益众","phone":"0550-3211709"},
  {"province":"安徽","city":"淮南市","shop":"凤台星众","phone":"0554-8883555"},
  {"province":"安徽","city":"阜阳市","shop":"阜阳伟杰","phone":"0558-2513333"},
  {"province":"安徽","city":"宣城市","shop":"广德众爱","phone":"0563-6982666"},
  {"province":"安徽","city":"合肥市","shop":"合肥大名","phone":"0551-64211111"},
  {"province":"安徽","city":"巢湖","shop":"合肥华锐","phone":"0551-82316777"},
  {"province":"安徽","city":"合肥市","shop":"合肥锦乐","phone":"0551-67317779"},
  {"province":"安徽","city":"合肥市","shop":"合肥锐众","phone":"0551-87651788"},
  {"province":"安徽","city":"合肥市","shop":"合肥伟朗","phone":"0551-67676661"},
  {"province":"安徽","city":"合肥市","shop":"合肥众鑫成","phone":"0551-68933088"},
  {"province":"安徽","city":"合肥市","shop":"恒信众和","phone":"0551-6553600"},
  {"province":"安徽","city":"淮北市","shop":"淮北华松","phone":"0561-3117899"},
  {"province":"安徽","city":"淮北市","shop":"淮北瑞耀","phone":"0561-3913888"},
  {"province":"安徽","city":"淮南市","shop":"淮南润众","phone":"0554-6419168"},
  {"province":"安徽","city":"淮南市","shop":"淮南鑫众","phone":"0554-3311555"},
  {"province":"安徽","city":"黄山市","shop":"黄山昱众","phone":"0559-2343666"},
  {"province":"安徽","city":"黄山市","shop":"黄山众发","phone":"0559-7810888"},
  {"province":"安徽","city":"六安市","shop":"六安德众","phone":"0564-3630888"},
  {"province":"安徽","city":"六安市","shop":"六安星众","phone":"0564-3260788"},
  {"province":"安徽","city":"马鞍山市","shop":"马鞍山澳众","phone":"0555-3503944"},
  {"province":"安徽","city":"马鞍山市","shop":"马鞍山中大","phone":"0555-2103778"},
  {"province":"安徽","city":"亳州市","shop":"蒙城春雨慧众","phone":"0558-7925999"},
  {"province":"安徽","city":"六安市","shop":"舒城景众","phone":"0564-8573777"},
  {"province":"安徽","city":"安庆市","shop":"太湖福众","phone":"0556-4568866"},
  {"province":"安徽","city":"安庆市","shop":"桐城锦众","phone":"0556-6753666"},
  {"province":"安徽","city":"铜陵市","shop":"铜陵众顺","phone":"0562-5327878"},
  {"province":"安徽","city":"亳州市","shop":"涡阳春雨慧众","phone":"0558-7298288"},
  {"province":"安徽","city":"芜湖市","shop":"芜湖亚众","phone":"0553-3930988"},
  {"province":"安徽","city":"芜湖市","shop":"芜湖易和福至","phone":"0553-2671888"},
  {"province":"安徽","city":"芜湖市","shop":"芜湖众爱","phone":"0553-5873366"},
  {"province":"安徽","city":"宿州市","shop":"宿州海昌","phone":"0557-3906777"},
  {"province":"安徽","city":"宣城市","shop":"宣城亚观","phone":"0563-2527188"},
  {"province":"安徽","city":"宣城市","shop":"宣城亚众","phone":"0563-2625618"},
  {"province":"河南","city":"安阳市","shop":"安阳大众","phone":"0372-2513111"},
  {"province":"河南","city":"安阳市","shop":"安阳福尔福","phone":"0372-3322888"},
  {"province":"河南","city":"安阳市","shop":"安阳威佳","phone":"0372-2113333"},
  {"province":"河南","city":"南阳市","shop":"邓州恒信众和","phone":"0377-60871000"},
  {"province":"河南","city":"郑州市","shop":"河南安吉","phone":"0371-60229922"},
  {"province":"河南","city":"郑州市","shop":"河南天顺成","phone":"0371-56590000"},
  {"province":"河南","city":"郑州市","shop":"河南豫港","phone":"0371-60536688"},
  {"province":"河南","city":"鹤壁市","shop":"鹤壁豫光","phone":"0392-6896666"},
  {"province":"河南","city":"南阳市","shop":"恒康锦程","phone":"0377-61889888"},
  {"province":"河南","city":"南阳市","shop":"恒康景程","phone":"0377-69966668"},
  {"province":"河南","city":"郑州市","shop":"恒信德龙","phone":"0371-55555563"},
  {"province":"河南","city":"安阳","shop":"滑县上众","phone":"0372-8585555"},
  {"province":"河南","city":"济源市","shop":"济源盛达","phone":"0391-2186666"},
  {"province":"河南","city":"焦作市","shop":"焦作国华","phone":"0391-2636111"},
  {"province":"河南","city":"焦作市","shop":"焦作泉达","phone":"0391-3567888"},
  {"province":"河南","city":"开封市","shop":"开封博宇","phone":"0371-23271111"},
  {"province":"河南","city":"开封市","shop":"开封金源","phone":"0371-22585111"},
  {"province":"河南","city":"安阳市","shop":"林州润豊","phone":"0372-6583999"},
  {"province":"河南","city":"三门峡市","shop":"灵宝豫之众","phone":"0398-2380777"},
  {"province":"河南","city":"洛阳市","shop":"洛阳德众","phone":"0379-65282222"},
  {"province":"河南","city":"洛阳市","shop":"洛阳众捷","phone":"0379-65273333"},
  {"province":"河南","city":"洛阳市","shop":"洛阳众芝宝","phone":"0379-63410598"},
  {"province":"河南","city":"漯河市","shop":"漯河新驭乐","phone":"0395-2152777"},
  {"province":"河南","city":"南阳市","shop":"南阳恒康","phone":"0377-63118999"},
  {"province":"河南","city":"南阳市","shop":"南阳威佳","phone":"0377-60893333"},
  {"province":"河南","city":"平顶山市","shop":"平顶山威佳","phone":"0375-6176666"},
  {"province":"河南","city":"濮阳市","shop":"濮阳龙润","phone":"0393-8115588"},
  {"province":"河南","city":"三门峡市","shop":"三门峡金利达","phone":"0398-2890777"},
  {"province":"河南","city":"商丘市","shop":"商丘恒昌","phone":"0370-2267361"},
  {"province":"河南","city":"商丘","shop":"商丘乐成","phone":"0370-2791777"},
  {"province":"河南","city":"新乡市","shop":"新乡东安新众","phone":"0373-7776888"},
  {"province":"河南","city":"新乡市","shop":"新乡上众","phone":"0373-2098999"},
  {"province":"河南","city":"新乡市","shop":"新乡申众","phone":"0373－3693333"},
  {"province":"河南","city":"新乡市","shop":"新乡天众","phone":"0373-5855555"},
  {"province":"河南","city":"郑州市","shop":"河南健坤",},
  {"province":"河南","city":"信阳市","shop":"信阳荣昇","phone":"0376-3355555"},
  {"province":"河南","city":"信阳市","shop":"信阳润州","phone":"0376-3719999"},
  {"province":"河南","city":"许昌市","shop":"许昌吉通","phone":"0374-7018777"},
  {"province":"河南","city":"许昌市","shop":"许昌佳辰","phone":"0374-3329777"},
  {"province":"河南","city":"商丘市","shop":"永城嘉翼","phone":"0370-5533999"},
  {"province":"河南","city":"郑州市","shop":"裕华上联","phone":"0371-66817777"},
  {"province":"河南","city":"新乡市","shop":"原阳东誉","phone":"0373-7587111"},
  {"province":"河南","city":"新乡市","shop":"长垣大江","phone":"0373-8083111"},
  {"province":"河南","city":"郑州市","shop":"郑州博业","phone":"0371-65780466"},
  {"province":"河南","city":"郑州市","shop":"郑州德道","phone":"0371-55085555"},
  {"province":"河南","city":"郑州市","shop":"郑州东锦","phone":"0371-55022111"},
  {"province":"河南","city":"郑州市","shop":"郑州东泰","phone":"0371-67661122"},
  {"province":"河南","city":"郑州市","shop":"郑州东泰润通","phone":"0371-89916100"},
  {"province":"河南","city":"郑州市","shop":"郑州聚龙","phone":"0371-65972266"},
  {"province":"河南","city":"郑州市","shop":"郑州兴飞","phone":"0371-67851999"},
  {"province":"河南","city":"周口市","shop":"周口威佳","phone":"0394-8928000"},
  {"province":"河南","city":"周口市","shop":"周口中德","phone":"0394-8691111"},
  {"province":"河南","city":"驻马店市","shop":"驻马店天成","phone":"0396-2955666"},
  {"province":"河南","city":"驻马店市","shop":"驻马店天浩","phone":"0396-2255111"}
]

export default rawData;